time = "1h 45m,360s,25m,30m 120s,2h 60s"

time = time.replace(" ", "")  # Убираем все пробелы между числаим
time = time.split(",")  # Создаем список, разделив всю строку на разные элементы, деление производим по запятой


def time_to_seconds(t,):  # Функцию частично подсказал ИИ, а точнее напомнил про isdigit()
    total = 0  # делаем переменную, в которую в конце запишем наше число в секундах
    num_str = ""  # делаем переменную строку, с которой дальше будем работать
    for ch in t:  # Для каждой переменной в строке, что мы передали в функцию делаем следующие команды
        if ch.isdigit():  # Проверяем число это или нет
            num_str += ch  # Если мы нашли число, добавляем его в нашу строку
        elif ch in ("h","m","s",):  # Смотрим если вместо числа мы нашли одну из трех букв, h,m или s, вы
            num = int(num_str)  # Переводим строку в число чтобы дальнше с ней работать
            if (ch == "h"):  # Если мы нашли h (часы), то переводим в секунды умножив на 3600
                total += num * 3600
            elif (ch == "m"):  # Если мы нашли m (часы), то переводим в секунды умножив на 60
                total += num * 60
            else:  # Если мы не нашли ни h, ни m, значит мы нашли s, ведь мы искали только среди этих трех символов. Переводить в секунды не надо, это и так секунды
                total += num
            num_str = ""  # Очищаем строку чтобы работать дальше. Например мы посчитали часы, а дальше идут минуты. Теперь будет считать их с пустой строчкой
    return total  # Возвращаем сумму секунд данного элемента, который мы отправили в функцию


total_all = 0  # Завели переменную чтобы посчитать общее количество секунд
for item in time:  # Смотрим каждый элемент в списке
    sec = time_to_seconds(item)  # Для каждого элемента в списке делаем нашу функцию
    total_all += sec  # Каждый элемент из списка после функции возвращается в секундах. суммируем их в total чтобы найти сумму
print("общее время:", total_all // 60, "минут")  # Делим на 60 чтобы найти в минутах, как сказано в задании. В задании не сказано нужен ли остаток секунд, поэтому просто минуты
