world_champions = {2002: "Бразилия", 2006: "Италия", 2010: "Испания", 2014: "Германия", 2018: "Франция"}

world_champions[2022] = "Аргентина"  # Добавляем ключ 2022, и значение Аргентина в этот ключ

for key, value in world_champions.items():  # Перебираем все ключи и значения из словаря
    print(key, "-", value)  # Для каждого значения печатаем ключ и значение. Каждое в новой строке

if "Италия" in world_champions.values():  # Находим есть ли Италия в списке значений словаря
    print("Италия cтановилась чемпионом мира по футболу в 21 веке!")
else:  # Если Италии нет
    print("Италия не выигрывала чемпионат мира по футболу в 21 веке.")
